test/artillery/token-issue/token-issue-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 1000
  defaults:
    headers:
      Content-Type: "application/json"
  payload:
    path: "../userId.csv"
    fields:
      - userId
    order: sequential

scenarios:
  - flow:
      - post:
          url: "/token/issue"
          json:
            userId: "{{ userId }}"